Table of Contents
Namespace IdeaStatiCa.BimApi
 Classes
BulkSelection
IdeaVector3D
A immutable class representing a point in a 3D euclidean space.
Selection
SingleSelection
 Interfaces
IIdeaAnchorGrid
Represent anchor grid extend IIdeaBoltGrid
IIdeaArcSegment3D
Represents the line segment of the element.
 Line segment is defined by three points returned by the StartNode, EndNode of the base class IIdeaSegment3D and ArcPoint.
IIdeaBend
Represent bend of folded plate
IIdeaBoltAssembly
IIdeaBoltGrid
Represent bolt grid
IIdeaCombiInput
IIdeaCombiItem
IIdeaConcreteBlock
IIdeaConnectedMember
Represent Connected Member - member 1D assigned in to connection
IIdeaConnectionModel
Extended IIdeaModel by method related by connection
IIdeaConnectionPoint
Represent connection point with all connected items
IIdeaCrossSection
A cross-section of an IIdeaElement1D.
IIdeaCrossSectionByCenterLine
A cross-section of a general cold formed profile defined by it's center line.
IIdeaCrossSectionByComponents
A generic cross-sectíons defined by its components.
IIdeaCrossSectionByName
A cross-section to import by name, any name is allowed. The correct cross-section is resolved by the user in CCM/Checkbot. Name must not be null.
IIdeaCrossSectionByParameters
A cross-section defined by parameters.
IIdeaCrossSectionComponent
A component of a IIdeaCrossSectionByComponents.
IIdeaCut
Represent cut operation
IIdeaElement1D
An element is a part of a member. Every member is comprised of one or more elements. It's geometry is defined by a Segment that can be either a line or an arc. It must specify cross-sections at both ends.
IIdeaElement2D
Representation of element2D
IIdeaFoldedPlate
Represent folded plate - connect IIdeaPlate and IIdeaBend in to one piece
IIdeaLineSegment3D
Represents the line segment of the element.
 Line segment is defined by two points returned by the StartNode and EndNode of the base class IIdeaSegment3D.
IIdeaLoadCase
IIdeaLoadGroup
IIdeaLoading
A load, only two subtypes are supported: load cases IIdeaLoadCase, combinations IIdeaCombiInput.
IIdeaMaterial
A material of a cross-section.
IIdeaMaterialByName
A material to import by name, any name is allowed. The correct material is resolved by the user in CCM/Checkbot. Name must not be null.
IIdeaMaterialConcrete
A concrete material.
IIdeaMaterialLibrary
TODO
IIdeaMaterialReinforcement
Material of a reinforcement.
IIdeaMaterialSteel
A steal material.
IIdeaMaterialTendon
Material of a tendon
IIdeaMember1D
Represents named and identifiable generic member of that connects to up to two end nodes and might go through other nodes.
 Member is used to represent beam, column, truss, rib or beamslab
 Members consist from one or more elements, each defining cros-section and materials.
IIdeaMember2D
Representation of member2D
IIdeaModel
Model for project to import.
IIdeaNegativePlate
An negative plate is a part of a connection.
IIdeaNode
Represents named and identifiable node that several members can connect to.
IIdeaObject
Represents named and identifiable BIM object.
 Names of the objects are general strings and there are no guarantees about their content. The names can be null strings, empty or any generic text value, event duplicated across the model, if the original BIM software allows that.
 Identifiers of the objects are strings that are guaranteed to be:
globally unique within the scope of the current model.
constant when the model is changed.
 are qua
IIdeaObjectConnectable
IIdeaObjectWithResults
IIdeaPersistenceToken
Describes an IIdeaPersistentObject object and hold all information necessary for restoration of the object. All implementations must be serializable.
IIdeaPersistentObject
An object that can be recreated at any point by its persistence Token.
IIdeaPlate
An plate is a part of a connection.
IIdeaPolyLine3D
Represents a polyline in three-dimensional space.
IIdeaRegion3D
Represents a region in three-dimensional space included outline (border) and openings.
IIdeaSegment3D
Represents the line or arc segment of the element.
 Each element has just one segment, that can be of either line or arc type. See derived interfaces IIdeaLineSegment3D and IIdeaArcSegment3D.
IIdeaSpan
Span allows specifying haunched member.
Both cross-sect
IIdeaTaper
Defines haunches (variyng cross-sections) along the member.
One IIdeaTaper may be assigned to multiple Members. Sections of the member not covered by a span will use the member's cross-section.
IIdeaWeld
An weld is a part of a connection.
IIdeaWorkPlane
 Enums
IdeaBeamSegmentEndFlags
IdeaBeamSegmentModelType
IdeaConnectedMemberType
IdeaForcesIn
IdeaGeometricalType
MaterialType
Types of material for import by name